app/controllers/memes_controller.rb

	def generate
		@meme = Meme.new
		@meme.text = Meme.generate_random_text
		@meme.image_url = Meme.generate_random_url

		if (!Meme.last.nil?)
			Meme.last.destroy
		end

		if @meme.save
---
DELETE FROM "memes" WHERE "memes"."id" = ?  [["id", 2]]
INSERT INTO "memes" ("text", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "5"], ["image_url", "44"], ["created_at", 2017-03-30 04:10:31 UTC], ["updated_at", 2017-03-30 04:10:31 UTC]]