app/controllers/memes_controller.rb

	def generate
		if (!Meme.exists?)
---
SELECT  "memes".* FROM "memes" ORDER BY "memes"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "memes" LIMIT ?  [["LIMIT", 1]]

	def return_all
		@meme = Meme.all.limit(Meme.count)
---
SELECT  "memes".* FROM "memes" LIMIT ?  [["LIMIT", 0]]
SELECT COUNT(*) FROM "memes"

	def save_meme

		if(Meme.exists?)
			@saved = Meme.new
			@saved = Meme.last.dup
			if(Meme.number_of_dup(@saved) < 2)
				if @saved.save
---
SELECT  "memes".* FROM "memes" ORDER BY "memes"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "memes" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "memes" ("text", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "88"], ["image_url", "77"], ["created_at", 2017-04-02 01:47:43 UTC], ["updated_at", 2017-04-02 01:47:43 UTC]]